import streamlit as st
st.set_page_config(page_title="综合侧边栏", layout="wide", page_icon='🎠')

st.title("这里是主页")

st.image("https://www.gxvnu.edu.cn/lib/images/bannner4.jpg",use_container_width=True)

st.write("""广西职业师范学院（GuangXi Vocational Normal University），坐落于广西壮族自治区南宁市，是广西壮族自治区人民政府直属、自治区教育厅主管的公办全日制普通本科学校，入选教育部 “新工科”研究与实践项目。 [1] [3]
学校前身为开办于1951年5月的广西省行政干部训练班，历经广西人民革命大学、广西省人民政府行政干部学校、广西壮族自治区五七干校和南宁市五七干校、广西壮族自治区经济干部学校、广西壮族自治区经济管理干部学院等历史时期，2019年6月，经教育部批准设置为“广西职业师范学院”。 [2]2021年10月，广西职业师范学院罗文校区正式启用。 [25]2022年，学校被评为广西壮族自治区绿色学校。 [33]
截至2025年3月，学校有罗文校区和相思湖校区；开设普通本科专业33个 [3]，建有广西高校重点实验室1个，自治区级实验教学中心2个，广西高等学校特色专业及课程一体化建设项目3个，自治区级虚拟教研室建设试点2个 [3] [19] [26]；截至2025年4月，学校有12个二级学院（部） [40]，有自治区级本科一流课程4门，自治区级课程思政示范课5门 [3]；截至2024年12月，学校总占地面积37.92万平方米，教学、科研仪器设备资产总值1.45亿元 [34]；有专任教师464人、外聘教师190人，全日制在校学生人数14371人 [34]。截至2024年9月，学校图书馆拥有纸质图书143.77万册，2024年年新增215790册，生均纸质图书99.77册；拥有电子期刊36.27万册，学位论文1013.82万册，音视频0.0小时。 [34]""")
